Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/sudden_or_unexplained_death/index.html.txt.tmx
Source language: en
Languages: ga

source: Sudden or unexplained death
ga: Bás obann nó gan mhíniú

source: When someone dies unexpectedly
ga: Nuair a fhaigheann duine bás gan choinne

source: An overview of what happens when someone dies as a result of an accident or in unexplained circumstances
ga: Forbhreathnú ar an méid a tharlaíonn nuair a fhaigheann duine bás de dheasca timpiste nó in imthosca nach bhfuil aon míniú orthu

source: This document is in: Death and Bereavement
ga: This document is in: Bás agus Méala

source: A Coroner in Ireland is an independent official with legal responsibility for the investigation of sudden and unexplained deaths
ga: Oifigeach neamhspléach é/í Cróinéir in Éirinn a bhfuil freagracht dlíthiúil air/uirthi maidir le básanna gan coinne agus básanna nach féidir a mhíniú a fhiosrú

source: A postmortem is a medical examination into the health of someone during their life and their cause of death
ga: Is éard atá i scrúdú iarbháis ná scrúdú ar shláinte duine nuair a bhí sé nó sí beo agus cúis a b(h)áis

source: Circumstances in which postmortems take place in Ireland
ga: Déantar scrúdaithe iarbháis ar dhaoine in Éirinn ar na cúinsí seo a leanas

source: Inquests are official enquiries into the cause of a sudden, unexplained or violent death of a person
ga: Is éard is coiste cróinéara in Éirinn ná fiosrúchán oifigiúil faoi bhás tobann, faoi bhás nach bhfuil aon mhíniú air nó faoi bhás lenár bhain foiréigean

source: Exhumation of the remains of a deceased person
ga: Corp duine a dhí-adhlacadh

source: Rules governing the exhumation of the remains of a deceased person in Ireland and how to apply for an exhumation licence
ga: Tá cur síos sa cháipéis seo ar na rialacha a bhaineann le corp duine a dhí-adhlacadh agus conas iarratas a dhéanamh ar cheadúnas dí-adhlactha

source: If someone in Ireland is missing and presumed dead, there are important implications for the estate of the missing person
ga: Céard a thárlaíonn do eastáit dhuine atá ar iarradh nuair a ghlactar leis iad a bheith marbh

source: Most Read in "Death and Bereavement"
ga: Ábhar is mó éilimh i "Bás agus Méala"

source: Dealing with the deceased's estate
ga: Deileáil le hEastát an Mhairbh
